# taps
tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/cask-drivers"
tap "homebrew/cask-versions"
tap "homebrew/core"
tap "thought-machine/please"

# formulas
brew "bash"
brew "bash-completion@2"
brew "bazelisk"
brew "coreutils"
brew "fd"
brew "fontconfig"
brew "fzf"
brew "ghc"
brew "git"
brew "git-delta"
brew "gradle"
brew "groovysdk"
brew "haskell-stack"
brew "jq"
brew "kotlin"
brew "luajit", args: ["HEAD"]
brew "mas"
brew "neovim", args: ["HEAD"]
brew "pyenv"
brew "ripgrep"
brew "rust-analyzer"
brew "rustup-init"
brew "shellcheck"
brew "thefuck"
brew "thought-machine/please/please"
brew "tree"
brew "watch"
brew "wget"
brew "yarn"

# casks
cask "alacritty"
cask "blackhole-2ch"
cask "chrysalis"
cask "discord"
cask "docker"
cask "emacs"
cask "firefox"
cask "keka"
cask "openemu"
cask "protonvpn"
cask "qmk-toolbox"
cask "rectangle"
cask "skype"
cask "slack"
cask "transmission"
cask "xld"
cask "xquartz"
cask "zoom"
