tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/cask-drivers"
tap "homebrew/core"
tap "mdogan/zulu"
brew "bash"
brew "bat"
brew "clojure"
brew "clojure-lsp"
brew "clojurescript"
brew "coreutils"
brew "exa"
brew "fish"
brew "fontconfig"
brew "fzf"
brew "git"
brew "git-delta"
brew "gnupg"
brew "gradle"
brew "helix"
brew "jq"
brew "leiningen"
brew "less"
brew "minikube"
brew "neovim"
brew "podman"
brew "pyright"
brew "python"
brew "ripgrep"
brew "rust-analyzer"
brew "rustup-init"
brew "tree"
brew "watch"
brew "wget"
cask "alacritty", args: {"no-quarantine": true}
cask "chrysalis"
cask "intellij-idea-ce"
cask "protonvpn"
cask "qmk-toolbox", args: {"no-quarantine": true}
cask "rectangle"
cask "skype"
cask "slack"
cask "transmission"
cask "vlc"
cask "xld"
cask "zoom"
cask "zulu-jdk17"
